---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.PartOfRiserLiesOnBoundaryFailure
source: html/1dcbcae5-bcd9-a994-ae8d-a6e586739b59.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.PartOfRiserLiesOnBoundaryFailure Property

Part of the riser lies on the boundary is not allowed.

## Syntax (C#)
```csharp
public static FailureDefinitionId PartOfRiserLiesOnBoundaryFailure { get; }
```